Revit 2026 API

# HostedSweepRemoveSegment Method

---

Remove segments from the hosted sweep object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveSegment(
	Reference targetRef
)
```
```vb
Public Sub RemoveSegment (
	targetRef As Reference
)
```
```cpp
public:
void RemoveSegment(
	Reference^ targetRef
)
```
```fsharp
member RemoveSegment :
        targetRef : Reference -> unit
```

#### Parameters

targetRef Reference
    Segment's reference which want to be removed.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when regeneration fails. |

#### Reference

HostedSweep Class

Autodesk.Revit.DB Namespace